# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, ключи — первые буквы имён,
# значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"

# out

# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

def new_dictionary(*arguments):
    new_dict = {}
    for i in sorted(arguments):
        j = i[0]
        if j not in new_dict:
            new_dict[j] = [i]
        else:
            new_dict[j] += [i]

    return new_dict


print(new_dictionary("Григорий", "Андрей", "Дарья",
      "Павел", "Павел", "Петр", "Мария", "Анна",))
